[  {    
        "titulo": "SignInUp",    
        "subtitulo": "Javascript",    
        "tecnologias": "Javascript, LocalStorage, Fetch API, JSON, Diseño web responsive",
        "descripcion": "Registro de usuario e inicio de sesión con validación. En el registro se validan los datos mostrando mensaje de error segun el caso, y de no haber error se comunica que el registro fue exitoso y se redirige a la pagina de inicio de sesion. Allí se podrá ingresar con el usuario creado, guardado anteriomente en el localstorage. La validación de este formulario se encarga de encontrar un usuario que coincida con la info guardada. Al iniciar sesión, el diseño de la página cambia para incluir un menú, un botón de logout y un fondo dinámico obtenido mediante una solicitud fetch a un archivo JSON. La aplicación permite la creación de varios usuarios desde un mismo navegador. El sitio es Web responsive.",
        "link": "https://belen-destefano.github.io/SignInUp/",
        "fondoA": "",
        "fondoB": "images/SignInUp.jpg"   
   },

   {    
       "titulo": "Tecno Stock",    
        "subtitulo": "React JS",    
        "tecnologias": " ReactJs, React Router Dom, Context, Conditional Rendering, Promesas, Firestore Database de Firebase, MaterializeCSS, React-Toastify, Diseño web responsive",
        "descripcion": " App e-commerce de tienda de productos de electrónica. Desarrollado con ReactJs. Funcionalidades: selección de productos según sus categorias. Una vez realizada la compra se modifica el stock de la base de datos de firebase y se obtiene un numero de orden que permite la búsqueda posterior de compras realizadas mediante un input en el carrito.     Contiene react router dom, context, conditional rendering, promesas; Firestore database de Firebase utilizado como base de datos vía Api y para la realizacion de categorias dinamicas de los productos; materializecss, react-toastify.",
        "link": "https://belen-destefano.github.io/tecno-stock/",
        "fondoA": "",
        "fondoB": "images/tecnoStock.jpg"   
    },

    {    
        "subtitulo": "Javascript",    
        "titulo": "Stone & Wood",    
        "tecnologias": "Javascript, jQuery, JSON, AJAX, Diseño web responsive ",
        "descripcion": " Sitio web creado como proyecto final para Javascript. Fue publicado en el sitio web de CoderHouse, donde realice los estudios, por quedar dentro del 10% de los estudiantes más destacados de la cursada. Desarrollado con Javascript, HTML y CSS. Funcionalidades: se puede seleccionar fechas mediante formulario; obtener el total segun la cantidad de dias y la habitación seleccionada mediante el uso del objeto Date; y realizar reserva por medio de un formulario de contacto. Contiene: funciones, objetos, jquery, JSON, AJAX y el uso de la API emailjs. El sitio es Web responsive.",
        "link": "https://belen-destefano.github.io/stone-wood/",
        "fondoA": "",
        "fondoB": "images/stoneWood.jpg"   
    },
    {    
        "titulo": "Selvage",    
        "subtitulo": "Javascript",    
        "tecnologias": "Javascript, jQuery, JSON, AJAX, API emailjs, Diseño web responsive",
        "descripcion": " Sitio web para una marca de ropa que utiliza materiales sustentables para su confección. Desarrollado con Javascript para una mejor experiencia de usuario. Funcionalidades: se puede seleccionar entre diferentes productos y manipular sus cantidades tanto en la página de productos como en el carrito, obtener el valor final total; buscar por categoría de producto y llenar formulario de contacto. Contiene: funciones, objetos, jquery, JSON, AJAX y el uso de la API emailjs. El sitio es Web responsive.",
        "link": "https://belen-destefano.github.io/Selvage/",
        "fondoA": "",
        "fondoB": "images/selvage.jpg"   
    },
    {    
        "titulo": "Creativa Publicitaria",    
        "subtitulo": "Desarrollo Web",    
        "tecnologias": "HTML, CSS, SASS, Bootstrap, GIT, Diseño web responsive",
        "descripcion": " Sitio web realizado en equipo: trabajé junto a otro desarrollador siguiendo el diseño ejecutado por dos diseñadoras UX/UI. El proyecto fue desarrollado para una empresa que se especializa en creacion y desarrollo de marcas. Para llevarlo a cabo utilizamos tecnologías como HTML, CSS, SASS y Bootstrap. Trabajamos en conjunto usando GIT y manejo de repositorio, lo que nos permitió mantener un registro de todas las modificaciones realizadas y colaborar de manera efectiva en el desarrollo. El sitio es Web responsive.",
        "link": "https://belen-destefano.github.io/creativaPublicitaria/",
        "fondoA": "",
        "fondoB": "images/creatrivaPublicitaria.jpg"   
    },
    {    
        "titulo": "Got Guilt",    
        "subtitulo": "Desarrollo Web",    
        "tecnologias": "HTML, CSS, Bootstrap, GIT, Diseño web responsive",
        "descripcion": "Sitio web que ofrece certificados personalizados de mentira y sin validez, a modo de chiste, los cuales te liberan de la culpa ocacionada por errores cometidos en el pasado. La idea es que el certificado les permita superar de manera humorística ciertas desiciones que tomaron y luego les genero arrepentimiento. Para llevar a cabo este proyecto de Desarrollo Web, utilice HTML, CSS y Bootstrap. Asimismo, he trabajado en base a un diseño de UX/UI creado por profesionales en la materia, con el fin de garantizar una experiencia de usuario óptima y satisfactoria. Utilicé GIT para mantener un registro de todas las modificaciones realizadas. El sitio es Web responsive.",
        "link": "https://belen-destefano.github.io/got-guilt/",
        "fondoA": "",
        "fondoB": "images/gotGuilt.jpg"   
    }
]